Services/src/Catalogs/С_ОбновлениеАдресногоКлассификатора/С_ОбновлениеАдресногоКлассификатора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>С_ОбновлениеАдресногоКлассификатора</name>
  <predefined>
    <items>
      <name>АдресныйКлассификатор</name>
      <description>Адресный классификатор</description>
    </items>
  </predefined>
  <attributes>
    <name>Текст1</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст2</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст3</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст4</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст5</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст6</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст7</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст0</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАдресногоКлассификатора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Services/src/InformationRegisters/С_АдресныйКлассификатор/С_АдресныйКлассификатор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>С_АдресныйКлассификатор</name>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Индекс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АльтернативныеНазвания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПризнакАктуальности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипАдресногоЭлемента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодАдресногоОбъектаВКоде</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодРайонаВКоде</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодГородаВКоде</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодНаселенногоПунктаВКоде</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодУлицыВКоде</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Код</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>SOATO</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Services/src/Catalogs/С_ОбновлениеАдресногоКлассификатора/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Функция  ВыгрузитьНаСервере()

 МассивОбластей = Новый Массив(7);
 ОбластьВыгрузки = 7;
 
 // инициализируем их значениями
 МассивОбластей[0] = Число(10000000000000000000);
 МассивОбластей[1] = Число(20000000000000000000);
 МассивОбластей[2] = Число(30000000000000000000); 
 МассивОбластей[3] = Число(40000000000000000000); 
 МассивОбластей[4] = Число(50000000010000000000); 
 МассивОбластей[5] = Число(60000000000000000000);
 МассивОбластей[6] = Число(70000000000000000000);
 
 Для Счт = 1 по ОбластьВыгрузки Цикл 
	 
	 Запрос = Новый Запрос;
	 
	 Запрос.УстановитьПараметр("МассивРегионов", Счт);
	 запрос.УстановитьПараметр("МассивОбластей", МассивОбластей);
	 
	 Запрос.Текст ="ВЫБРАТЬ
	 | АдресныйКлассификатор_Локализация_Без_Регионов.ТипАдресногоЭлемента,
	 | АдресныйКлассификатор_Локализация_Без_Регионов.КодАдресногоОбъектаВКоде,
	 | АдресныйКлассификатор_Локализация_Без_Регионов.КодРайонаВКоде,
	 | АдресныйКлассификатор_Локализация_Без_Регионов.КодГородаВКоде,
	 | АдресныйКлассификатор_Локализация_Без_Регионов.КодНаселенногоПунктаВКоде,
	 | АдресныйКлассификатор_Локализация_Без_Регионов.КодУлицыВКоде,
	 | АдресныйКлассификатор_Локализация_Без_Регионов.Код КАК Код,
	 | АдресныйКлассификатор_Локализация_Без_Регионов.Наименование,
	 | АдресныйКлассификатор_Локализация_Без_Регионов.Сокращение,
	 | АдресныйКлассификатор_Локализация_Без_Регионов.Индекс,
	 | АдресныйКлассификатор_Локализация_Без_Регионов.АльтернативныеНазвания,
	 | АдресныйКлассификатор_Локализация_Без_Регионов.ПризнакАктуальности
	 |ИЗ
	 | РегистрСведений.С_АдресныйКлассификатор КАК АдресныйКлассификатор_Локализация_Без_Регионов
	 |ГДЕ
	 | АдресныйКлассификатор_Локализация_Без_Регионов.КодАдресногоОбъектаВКоде В(&МассивРегионов) И НЕ
	 | АдресныйКлассификатор_Локализация_Без_Регионов.Код В (&МассивОбластей)
	 |
	 |УПОРЯДОЧИТЬ ПО
	 | Код";
	 
	 
	 РезЗапроса = Запрос.Выполнить().Выгрузить();
	 
	 ТабДокумент = Новый ТабличныйДокумент;
	 
	 Заголовки = Новый Структура;
	 ОбластьВывода = ТабДокумент.ПолучитьОбласть(1, 1, 1, РезЗапроса.Колонки.Количество());
	 Для Счетчик = 1 по РезЗапроса.Колонки.Количество() Цикл
		 ОбластьЗаполнения = ОбластьВывода.Область(1, Счетчик, 1, Счетчик);
		 Колонка = РезЗапроса.Колонки[Счетчик-1];
		 ОбластьЗаполнения.Параметр = Колонка.Имя;
		 ОбластьЗаполнения.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
		 Заголовки.Вставить(Колонка.Имя, Колонка.Имя);
	 КонецЦикла;
	 ОбластьВывода.Параметры.Заполнить(Заголовки);
	 ТабДокумент.Вывести(ОбластьВывода);
	 
	 Выборка=Запрос.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл
		 ОбластьВывода.Параметры.Заполнить(Выборка);
		 ТабДокумент.Вывести(ОбластьВывода);
	 КонецЦикла;
	 
	 //КонвертироватьВXML 
	 Колонок = ТабДокумент.ШиринаТаблицы;
	 ИменаКолонок = Новый Массив;
	 ИменаКолонокСтр = "";
	 Для Сч = 1 По Колонок Цикл
		 ИмяТаблицы = ТабДокумент.Область(1, Сч).Текст;
		 ИменаКолонок.Добавить(ИмяТаблицы);
		 ИменаКолонокСтр = ИменаКолонокСтр + ?(Сч = 1, "", ",") + ИмяТаблицы;
	 КонецЦикла;
	 
	 Запись = Новый ЗаписьXML;
	 Запись.УстановитьСтроку("UTF-8");
	 Запись.ЗаписатьНачалоЭлемента("Items");
	 
	 Для СчСтр = 2 По ТабДокумент.ВысотаТаблицы Цикл
		 Запись.ЗаписатьНачалоЭлемента("Item");
		 Для СчКол = 1 По Колонок Цикл
			 Запись.ЗаписатьАтрибут(ИменаКолонок[СчКол-1], ТабДокумент.Область(СчСтр, СчКол).Текст);
		 КонецЦикла;
		 Запись.ЗаписатьКонецЭлемента();
	 КонецЦикла;
	 
	 Запись.ЗаписатьКонецЭлемента();
	 
		 Объект["Текст" + Строка(Счт)] = Запись.Закрыть();
		 Объект["Текст" + Строка(Счт)]  = СтрЗаменить(Объект["Текст" + Строка(Счт)], "<Items>" + Символы.ПС, "");
		 Объект["Текст" + Строка(Счт)]  = СтрЗаменить(Объект["Текст" + Строка(Счт)], "</Items>" , "");
	 
	 ОбластьВывода.Очистить();
	 ТабДокумент.Очистить();
	 
 КонецЦикла; 
 Записать();
КонецФункции

&НаКлиенте
Процедура Выгрузить(Команда)
 
 Док = ВыгрузитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	
	Объект.Текст1 = "";
	Объект.Текст2 = "";
	Объект.Текст3 = "";
	Объект.Текст4 = "";
	Объект.Текст5 = "";
	Объект.Текст6 = "";
	Объект.Текст7 = "";
	
КонецПроцедуры
